Revit 2027 API
FramingShapeClassification Enumeration
 This enumeration is used to classify MEP Ancillary Framing shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FramingShapeClassification
Public Enumeration FramingShapeClassification
public enum class FramingShapeClassification
type FramingShapeClassification
Members
Member name | Value | Description
Circular | 1
Linear | 0
Other | 3
Oval | 2
See Also
Reference
Autodesk.Revit.DB Namespace